
# Задача 2.

# p = вероятността роботът да сглоби дефектен елемент
# H0: p = 0.035
# H1: p < 0.035

prop.test( x=15, n=500, p=0.035, alternative="less", correct=T )

# Верен е първият резултат!
# (alternative hypothesis: true p is less than 0.035)

# p.value = 0.3132 > 0.05
# => не отхвърляме Н0
# Нямаме основание да твърдим, че вероятността роботът да сглоби дефектен елемент 
# е по-малка от 0.035.
# [Не може да се твърди, че процентът дефектни елементи при използване на 
# робот е по-малък отколкото при сглобяване от човек.]


# Задача 3.

# mu_1 = средна оценка по Алгебра 1
# mu_2 = средна оценка по Алгебра 2

# H0: mu_1 = mu_2
# H1: mu_1 > mu_2

t.test( a1, a2, alternative="greater", paired=T )

# Верен е първият резултат! 
# (Използва се Paired t-test, тъй като извадките са сдвоени/зависими.)

# p.value = 1.422e-05 < 0.05
# => отхвърляме Н0
# Имаме основание да твърдим, че в средно оценките по Алгебра 1 са по-високи 
# от тези по Алгебра 2.


# Задача 4.

# а) Напишете оцененото регресионно уравнение. 

# модел:
# grade = beta0 + beta1*study.hours + eps

# оценено регресионно уравнение:
# grade = 1.01617 + 0.15806*study.hours

# б) Интерпретирайте оценения коефициент за предиктора.

# При един час повече подготовка за изпита оценката е по-висока 
# средно с 0.15806.

# в) Може ли да се твърди, че има линейна връзка между оценката 
# и часовете, отделени за подготовка?

# H0: beta1 = 0
# H1: beta1 != 0

# p.value = 2.9e-12 < 0.05 
# => отхвърляме Н0
# Може да се твърди, че има линейна връзка между оценката и часовете, отделени за
# подготовка.

# г) Напишете оцененото регресионно уравнение. Интерпретирайте коефициентите 
# пред предикторите.

# модел:
# grade = beta0 + beta1*study.hours + beta2*lectures + eps

# оценено регресионно уравнение:
# grade = 0.54255 + 0.14767*study.hours + 0.09432*lectures

# При един час повече подготовка за изпита и фиксиран брой посетени лекции 
# оценката е по-висока средно с 0.14767.

# При още една посетена лекция и фиксирани часове за подготовка за изпита
# оценката е по-висока средно с 0.09432.


###
